{
  "pages": [
    {
      "title": "Introdução",
      "content": "Bem-vindo ao tutorial básico de programação GNU Bash!\n\nAqui você aprenderá os conceitos básicos de programação GNU Bash (Bourne Again Shell).\n\nO GNU Bash Trata-se tanto de uma linguagem de programação quanto de um interpretador.\n\nPor essa razão, antes de adentrarmos definitivamente na linguagem de programação,\nprecisaremos revisar alguns termos fundamentais para não gerar confusões futuras.\n\nPrimeiramente, você se depara com o programa bash, vulgo shell, geralmente no diretório /bin,\neste programa bash que define a referência da linguagem de programação tanto quanto interpreta a linguagem em si,\nalém de interpretar comandos de terminais de alguns sistemas GNU/Linux.\n\nPense, quando você abre um terminal no GNU/Linux,\nacaba se deparando com uma tela preta e vê aquele prompt esperando que digite algum comando,\nvocê simplesmente acaba tendo o bash sendo processado em modo interativo com o terminal,\nou seja quando comandos são lidos através do console,\nesse é o nosso shell, uma ferramenta que permite executar comandos, seviços, programas e etc,\npara realizarmos ações sobre o sistema operacional.\n\nShell é um programa que atua como interface entre o sistema operacional e o usuário, simplificando,\nshell é o programa que interpreta o comando que você digitar e traduz em instruções para o sistema executar,\no shell é como se fosse uma concha que envolve o sistema operacional permitindo que você interaja de maneira mais fácil,\njá no caso em questão o nosso shell é o bash.\n\nPense mais uma vez, quando você escreve um código Bash dentro de um arquivo .sh,\nagora esse é o nosso shell script, um arquivo que é interpretado por um shell,\nno nosso caso interpretado em GNU Bash.\n\nFundamentalmente o GNU Bash é um programa que interpreta comandos shell,\nmas também armazena a definição da referência do shell script,\nentenda como bash como linguagem de script assim como python e javascript."
    },
    {
      "title": "Variáveis",
      "content": "Em Bash, variáveis são declaradas assim:\n\n    nome=\"valor\"\n\nSem espaços ao redor do '='!\n\nPara acessar o valor de uma variável, use o símbolo $:\n\n    echo $nome\n\nOu com chaves para maior clareza:\n\n    echo ${nome}\n\nExemplos práticos:\n\n    # Declarando variáveis\n    nome=\"João\"\n    idade=25\n    cidade=\"São Paulo\"\n\n    # Usando variáveis\n    echo \"Meu nome é $nome\"\n    echo \"Tenho ${idade} anos\"\n    echo \"Moro em $cidade\"\n\nVariáveis especiais do Bash:\n\n    $0  - Nome do script\n    $1  - Primeiro argumento\n    $2  - Segundo argumento\n    $#  - Número de argumentos\n    $@  - Todos os argumentos\n    $?  - Código de saída do último comando\n    $$  - PID do processo atual"
    },
    {
      "title": "Condicionais",
      "content": "Use if/then/else para decisões:\n\n    if [ condição ]; then\n        comando\n    fi\n\nEstrutura completa com else:\n\n    if [ condição ]; then\n        comando1\n    else\n        comando2\n    fi\n\nUsando elif para múltiplas condições:\n\n    if [ condição1 ]; then\n        comando1\n    elif [ condição2 ]; then\n        comando2\n    else\n        comando3\n    fi\n\nOperadores de comparação numérica:\n\n    -eq  : igual\n    -ne  : diferente\n    -lt  : menor que\n    -le  : menor ou igual\n    -gt  : maior que\n    -ge  : maior ou igual\n\nOperadores de comparação de strings:\n\n    =    : igual\n    !=   : diferente\n    -z   : string vazia\n    -n   : string não vazia\n\nExemplo prático:\n\n    idade=18\n    if [ $idade -ge 18 ]; then\n        echo \"Maior de idade\"\n    else\n        echo \"Menor de idade\"\n    fi"
    }
  ]
}
